<?php
/* ****************************************************************************************** */
/* created by soft-solution.ru                                                                */
/* greetings.php of component greetings for InstantCMS 1.10.2                                 */
/* ****************************************************************************************** */
if(!defined('VALID_CMS')) { die('ACCESS DENIED'); }

$_LANG['GREETINGS']              ='Поздравления';
$_LANG['ADD_GREETINGS']          ='Добавить поздравление';
$_LANG['EDIT_GREETINGS']         ='Редактировать поздравление';
$_LANG['DELETE_GREETINGS']       ='Удалить поздравление';

$_LANG['TITLE_GREETINGS']        ='Заголовок поздравления';
$_LANG['DESC_GREETINGS']         ='Текст поздравления:';
$_LANG['DESC_NOT_EMPTY']         ='Поле Текст поздравления обязательно для заполнения';

$_LANG['ADD_GREETINGS_SUCCESS']  ='Поздравление добавлено';
$_LANG['ADD_GREETINGS_NOPUB']    ='Поздравление добавлено. После модерации оно будет опубликовано';
$_LANG['EDIT_GREETINGS_SUCCESS'] ='Изменения сохранены';

$_LANG['NO_GREETINGS']           ='Нет поздравлений';
$_LANG['NO_RIGHTS']              ='Нет прав';
$_LANG['NO_PERM_ADD_GREETINGS']  ='К сожалению, вы не можете добавлять поздравления';
$_LANG['NO_PERM_EDIT_GREETINGS'] ='К сожалению, вы не можете редатировать поздравление';

$_LANG['NO_ADD_TODAY']           ='Исчерпан лимит добавления поздравлений на сегодня. Попробуйте позже.';
$_LANG['ERR_CAPTCHA']            ='Неправильно указан код с картинки!';

$_LANG['CHOOSE_FROM_COLLECTION'] ='Выбрать изображение из коллекции сайта';
$_LANG['LOAD_IMAGE']             ='Загрузить изображение';
$_LANG['ERROR_TYPE_FILE']        ='Тип файла не входит в состав разрешённых<br/>Разрешённые типы файлов';
$_LANG['TYPES_FILES']            ='Картинка jpg, jpeg, png, gif, bmp';

$_LANG['GREETING_DELETE']        ='Поздравление удалено';
$_LANG['YOUR_GREETING']          ='Ваше поздравление ';
$_LANG['WAS_DELETED']            =' удалено';

$_LANG['SECUR_SPAM']             ='Защита от спама';
$_LANG['SECUR_SPAM_TEXT']        ='Введите символы, изображенные на картинке';
$_LANG['GUEST']                  ='Гость';

$_LANG['GR_IS_ADDED']            ='Поздравление успешно добавлено.';
$_LANG['GR_PREMODER_TEXT']       ='Поздравление будет опубликовано после проверки администратором.';

$_LANG['MSG_GR_SUBMIT']          ='Пользователь %user% добавил поздравление "<b>%link%</b>".'."\n".'Необходима модерация.';
$_LANG['MSG_GR_EDITED']          ='Пользователь %user% изменил поздравление "<b>%link%</b>".'."\n".'Необходима модерация.';
$_LANG['MSG_GR_ACCEPTED']        ='Ваше поздравление "%link%" прошло модерацию и было опубликовано.';
$_LANG['GR_EDIT_PREMODER_TEXT']  ='Поздравление скрыто и будет вновь опубликовано после проверки администратором.';

$_LANG['GR_IS_MODER']            ='Поздравление находится на модерации';
$_LANG['GR_IS_ACCEPTED']         ='Поздравление опубликовано';

?>